Revit 2026 API

# AdvancedLayeredLayeredAnisotropy Property

---

The property labeled "Anisotropy" from the "AdvancedLayered" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string LayeredAnisotropy { get; }
```
```vb
Public Shared ReadOnly Property LayeredAnisotropy As String
	Get
```
```cpp
public:
static property String^ LayeredAnisotropy {
	String^ get ();
}
```
```fsharp
static member LayeredAnisotropy : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble". This property allows a connected asset.

#### Reference

AdvancedLayered Class

Autodesk.Revit.DB.Visual Namespace